Repository: eixaufnex/Capstone-005D-Grupo1
Catalog: Fase 2/Evidencias Proyecto/Evidencias de sistema/Proyecto/seguimiento_deportes/lib/l10n/intl_*.arb
Languages: es

# privacidad_datos2
source: In our application, we protect the personal data of our users in compliance with Law No. 19,628 on the Protection of Privacy. This policy describes how we collect, use and protect personal information, in addition to ensuring the user's informed consent to promote greater awareness about the protection of their privacy.
es: En nuestra aplicación, protegemos los datos personales de nuestros usuarios en cumplimiento de la Ley N°19.628 sobre Protección de la Vida Privada. Esta política describe cómo recopilamos, usamos y protegemos la información personal, además de asegurar el consentimiento informado del usuario para promover una mayor conciencia sobre la protección de su privacidad.

# privacidad_datos3
source: 2. Context: Law N°19.628
es: 2. Contexto: Ley N°19.628

# privacidad_datos4
source: This law guarantees the rights of access, rectification and deletion of personal data and prohibits the use of such data without the owner's consent, except in specific cases. It also establishes the obligation to adopt adequate security measures to protect the data and to inform about the purpose of its collection.
es: Esta ley garantiza los derechos de acceso, rectificación y eliminación de datos personales y prohíbe el uso de estos sin el consentimiento del titular, salvo en casos específicos. Asimismo, establece la obligación de adoptar medidas de seguridad adecuadas para proteger los datos y de informar sobre el propósito de su recolección.

# privacidad_datos5
source: 3. Legal and Regulatory Compliance
es: 3. Cumplimiento Legal y Normativo

# privacidad_datos6
source: To ensure compliance with Law No. 19,628 in our mobile and web application, we apply the following measures:
es: Para asegurar el cumplimiento de la Ley N°19.628 en nuestra aplicación móvil y web, aplicamos las siguientes medidas:

# privacidad_datos7
source: - Identification of personal data:
es: - Identificación de datos personales:

# privacidad_datos8
source: We request only the data necessary for the operation of the application.
es: Solicitamos únicamente los datos necesarios para el funcionamiento de la aplicación.

# privacidad_datos9
source: - Accessible privacy policy:
es: - Política de privacidad accesible:

# privacidad_datos10
source: We clearly explain the purpose and use of the data collected.
es: Explicamos claramente el propósito y uso de los datos recopilados.

# privacidad_datos11
source: - Informed consent:
es: - Consentimiento informado:

# privacidad_datos12
source: We obtain the user's clear and understandable consent before collecting their data.
es: Obtenemos el consentimiento claro y comprensible del usuario antes de recopilar sus datos.

# privacidad_datos13
source: - User's rights:
es: - Derechos del usuario:

# privacidad_datos14
source: We offer options for users to access, correct or delete their data at any time.
es: Ofrecemos opciones para que los usuarios accedan, rectifiquen o eliminen sus datos en cualquier momento.

# privacidad_datos15
source: - Safety measures:
es: - Medidas de seguridad:

# privacidad_datos16
source: We protect information through encryption, authentication and secure transmission protocols.
es: Protegemos la información mediante cifrado, autenticación y protocolos seguros de transmisión.

# privacidad_datos17
source: - Team training:
es: - Capacitación del equipo:

# privacidad_datos18
source: We ensure that our team is trained in secure data handling.
es: Garantizamos que nuestro equipo esté capacitado en el manejo seguro de datos.

# privacidad_datos19
source: - Transparency:
es: - Transparencia:

# privacidad_datos20
source: We inform users of any changes in the handling of their data.
es: Informamos a los usuarios sobre cualquier cambio en el manejo de sus datos.

# privacidad_datos21
source: 4. Requested Data
es: 4. Datos Solicitados

# privacidad_datos22
source: We collect the following types of personal data to personalize the user experience:
es: Recopilamos los siguientes tipos de datos personales para personalizar la experiencia de los usuarios:

# privacidad_datos23
source: - Identification:
es: - Identificación:

# privacidad_datos24
source: Name, e-mail and telephone number (optional).
es: Nombre, correo electrónico y número de teléfono (opcional).

# privacidad_datos25
source: - Health and Fitness:
es: - Salud y Fitness:

# privacidad_datos26
source: Age, gender, weight, height, fitness goals and activity level.
es: Edad, género, peso, altura, objetivos fitness y nivel de actividad.

# privacidad_datos27
source: - Exercise Preferences:
es: - Preferencias de Ejercicio:

# privacidad_datos28
source: Preferred types of exercise and frequency of training.
es: Tipos de ejercicio preferidos y frecuencia de entrenamiento.

# privacidad_datos29
source: - Progress:
es: - Progreso:

# privacidad_datos30
source: Training record (exercises, duration and intensity) and body measurements.
es: Registro de entrenamiento (ejercicios, duración e intensidad) y medidas corporales.

# privacidad_datos31
source: - Notifications:
es: - Notificaciones:

# privacidad_datos32
source: Communication preferences for reminders and motivational messages.
es: Preferencias de comunicación para recordatorios y mensajes motivacionales.

# privacidad_datos33
source: 5. Confidentiality and Use of Data
es: 5. Confidencialidad y Uso de los Datos

# privacidad_datos34
source: All information collected is treated with strict confidentiality and used exclusively for the purposes of improving the application experience. The data is protected in accordance with the legal regulations in force.
es: Toda la información recopilada se trata con estricta confidencialidad y se utiliza exclusivamente para los fines de mejorar la experiencia en la aplicación. Los datos están protegidos de acuerdo con las normativas legales vigentes.

# aplicado
source: applied
es: aplicado

# Claro
source: Light
es: Claro

# Oscuro
source: Dark
es: Oscuro

# genero
source: Gender
es: Genero

# seleccion_rutina
source: Select your Routine
es: Selecciona tu Rutina

# Fuerza
source: Strength
es: Fuerza

# Deporte_equipo
source: Team sports
es: Deporte en equipo

# Elongacion
source: Elongation
es: Elongación

# Flexibilidad
source: Flexibility
es: Flexibilidad

# crea_rutina
source: Create your new Routine
es: Crea tu nueva Rutina

# Nombre_rutina
source: Name of your Routine
es: Nombre de tu Rutina

# elige_icono
source: Choose your Icon
es: Elige tu Icono

# tipo_rutina
source: Type of Routine
es: Tipo de Rutina

# crea_rutina1
source: Routine successfully created
es: Rutina creada exitosamente

# crea_rutina2
source: Error creating the routine
es: Error al crear la rutina

# crear
source: Create
es: Crear

# crear_rutina
source: Create routine
es: Crear rutina

# no_rutinas
source: You have no routines created
es: No tienes Rutinas creadas

# estas_seguro_rutina
source: Are you sure?
es: ¿Estás seguro?

# deseas_guardar
source: Do you want to keep this routine?
es: ¿Deseas guardar esta rutina?

# rutina_guardada
source: Routine saved successfully
es: Rutina guardada exitosamente

# rutina_guardada1
source: There was an error saving the routine
es: Hubo un error al guardar la rutina

# rellena_manera
source: Fill your routine your way!
es: ¡Rellena tu rutina a tu manera!

# id_rutina
source: Routine ID
es: ID de Rutina

# agrega_ejercicios
source: You have to add your exercises
es: Tienes que agregar tus ejercicios

# guardar
source: Save
es: Guardar

# agrega_nuevo_ejercicio
source: Add a new exercise
es: Agrega un nuevo ejercicio

# confimar_eliminacion
source: Confirm deletion
es: Confirmar eliminación

# confimar_eliminacion1
source: Are you sure you want to eliminate this exercise?
es: ¿Estás seguro que deseas eliminar este ejercicio?

# eliminacion_ejercicio
source: Exercise successfully eliminated
es: Ejercicio eliminado exitosamente

# eliminacion_ejercicio1
source: Error when eliminating exercise
es: Error al eliminar el ejercicio

# no_ejercicios_rutina
source: There are no exercises in this routine.
es: No hay ejercicios en esta rutina.

# datos_guardados
source: Data successfully saved for the specific exercise
es: Datos guardados exitosamente para el ejercicio específico

# rutina_actual
source: Current Routine
es: Rutina Actual

# rutina_historial
source: Progress History
es: Historial de Progreso

# Observaciones
source: Observations
es: Observaciones

# Observaciones1
source: Add your sensations to the routine
es: Añade tus sensaciones en la rutina

# tonelaje
source: Tonnage
es: Tonelaje

# no_historial
source: No history available.
es: No hay historial disponible.

# progreso_historial
source: Progress of
es: Progreso del

# comentarios
source: Comments
es: Comentarios

# Serie
source: Series
es: Serie

# Diario
source: Daily
es: Diario

# Mensual
source: Monthly
es: Mensual

# rendimiento_fisico
source: Physical Performance
es: Rendimiento Físico

# Lun
source: Mon
es: Lun

# Mar
source: Tue
es: Mar

# Mie
source: Wed
es: Mié

# Jue
source: Thu
es: Jue

# Vie
source: Fri
es: Vie

# Sab
source: Sat
es: Sáb

# Dom
source: Sun
es: Dom

# progreso_entrenamiento
source: Training Progress
es: Progreso de Entrenamiento

# filtrar
source: Filter
es: Filtrar

# Seleccionar_rutina
source: Select Routine
es: Seleccionar Rutina

# Seleccionar_ejercicio
source: Select Exercise
es: Seleccionar Ejercicio

# graficos
source: Graphics
es: Gráficos

# consejo
source: Add advice
es: Publicar Consejo

# consejo1
source: Write your advice here...
es: Escribe tu consejo aquí...

# agregar
source: Add
es: Agregar

# publi
source: Publications
es: Comunidad

# no_publi
source: No publications available.
es: No hay publicaciones disponibles.

# no_descripcion
source: No description
es: Sin descripción

# fecha
source: Date
es: Fecha

source: Like
es: Me gusta

# eliminar_publi
source: Delete Publication
es: Eliminar Publicación

# eliminar_publi1
source: Are you sure you want to delete this post?
es: ¿Estás seguro de que deseas eliminar esta publicación?
