Repository: eixaufnex/Capstone-005D-Grupo1
Catalog: Fase 2/Evidencias Proyecto/Evidencias de sistema/Proyecto/seguimiento_deportes/lib/l10n/intl_*.arb
Languages: es

source: Log In
es: Iniciar sesión

source: Email
es: Correo electrónico

source: Password
es: Contraseña

source: Confirm Password
es: Confirmar Contraseña

source: Enter
es: Confirmar

source: ¿Don't have an account?
es: ¿No tienes cuenta?

source: Sing Up
es: Regístrate

source: Or log in with Google
es: O iniciar sesión con Google

# emailsample
source: Email@gmail.com
es: Correo@gmail.com

# datos_google
source: Complete the fields for a better user experience
es: Completa los campos para una mejor experiencia de usuario

# label_username
source: username
es: Nombre de Usuario

# label_name
source: Name
es: Nombre

# label_lastname
source: Last name
es: Apellido

# label_age
source: Age
es: Edad

# label_weight
source: Weight (kg)
es: Peso (kg)

# label_height
source: Height (cm)
es: Estatura (cm)

# label_gender
source: Select your gender
es: Selecciona tu género

# label_man
source: Man
es: Hombre

# label_woman
source: Woman
es: Mujer

# label_intensity
source: Intensity level
es: Nivel de intensidad

# label_intensity1
source: Beginner
es: Principiante

# label_intensity2
source: Medium
es: Medio

# intermedio
source: intermediate
es: Intermedio

# label_intensity3
source: Advanced
es: Avanzado

# save
source: Save and continue
es: Guardar y continuar

# login1
source: Empty fields
es: Campos vacíos

# login2
source: Please complete all fields
es: Por favor, complete todos los campos.

source: Try again!
es: Intentelo de nuevo!

# tryagain2
source: Incorrect email or password.
es: Correo o Contraseña incorrectos.

# cancel
source: Login canceled
es: Inicio de sesión cancelado

# cancel2
source: The user canceled the login.
es: El usuario canceló el inicio de sesión.

# error2
source: Authentication error
es: Error de autenticación

# error3
source: An error occurred while logging in with Google.
es: Ocurrió un error al iniciar sesión con Google.

# error4
source: Error logging in with Google. Please try again.
es: Error al iniciar sesión con Google. Por favor, inténtelo de nuevo.

# aceptar
source: Accept
es: Aceptar

# min6
source: Minimum 6 characters
es: Mínimo 6 caracteres

# valid_email
source: Enter a valid email address
es: Ingrese un correo válido

# no_correo
source: The value entered is not an email
es: El valor ingresado no es un correo

# nombreusuario
source: Enter a user name
es: Ingresa un nombre de usuario

# continue_register
source: Continue
es: Continuar

# passwordmatch
source: Passwords do not match.
es: Las contraseñas no coinciden.

# emailvalid
source: The email is not valid.
es: El Correo no es válido.

# emailused
source: The email is already in use.
es: El correo ya está en uso.

# yatienescuenta
source: ¿Do you already have an account?
es: ¿Ya tienes una cuenta?

# cerrar
source: Close
es: Cerrar

source: Loading...
es: Cargando...

# home1
source: Give it all you've got!
es: Dale con todo!

# thanksuser
source: Thank you very much for sharing with us how you feel.
es: Muchas gracias por compartirnos como te sientes.

# listaejercicio1
source: List of exercises
es: Lista de ejercicios

# logros1
source: Achievements
es: Logros

# objetivos1
source: Objectives
es: Objetivos

# glosario1
source: Glossary
es: Glosario

# cerrarsesion
source: Log out
es: Cerrar sesión

# hola
source: ¡Hello,
es: ¡Hola,

# comotesientes
source: ¿How are you feeling today?
es: ¿Cómo te sientes hoy?

# triste
source: Sad
es: Triste

# bien
source: Good
es: Bien

# Superbien
source: Super Good
es: Superbién

# recomendado
source: Recommended
es: Recomendado

source: Home
es: Inicio

# rutina
source: Routines
es: Rutinas

# Progreso
source: Progress
es: Progreso

# perfil
source: Profile
es: Perfil

# nivel
source: Level
es: Nivel

# rutinafuerza1
source: Strength Routine
es: Rutina de Fuerza

# rutinacardio1
source: Cardio Routine
es: Rutina de Cardio

# rutinaflexibilidad1
source: Flexibility Routine
es: Rutina de Flexibilidad

# ejercicios
source: Exercises
es: Ejercicios

source: Apply
es: Aplicar

source: Change Language
es: Cambiar idioma

# oneRM_One_Repetition_Maximum
source: 1RM (One Repetition Maximum)
es: 1RM (Repetición Máxima)

source: Grip
es: Agarre

source: Aerobic
es: Aeróbico

source: Isolation
es: Aislamiento

source: Range of Motion (ROM)
es: Amplitud de Movimiento (ROM)

source: AMRAP (As Many Reps As Possible)
es: AMRAP (Tantas Repeticiones Como Sea Posible)

source: Swinging
es: Balanceo

source: Biceps
es: Bíceps

source: Biomechanics
es: Biomecánica

source: Warm-Up
es: Calentamiento

source: Training Cycle
es: Ciclo de Entrenamiento

source: Pull-Ups
es: Dominadas

# e1RM_Estimated_One_Repetition_Maximum
source: e1RM (Estimated 1 Repetition Maximum)
es: e1RM (Máxima Repetición Estimada)

source: EMOM (Every Minute On the Minute)
es: EMOM (Cada Minuto Al Minuto)

source: Strength Training
es: Entrenamiento de Fuerza

source: Stretching
es: Estiramiento

source: Compound Exercise
es: Ejercicio Compuesto

source: Failure
es: Fallo

source: Muscle Failure
es: Fallo Muscular

source: Flexibility
es: Flexibilidad

source: Muscle Gain
es: Ganar Masa Muscular

source: Glutes
es: Glúteos

source: Hyperextension
es: Hiperextensión

source: Hypertrophy
es: Hipertrofia

source: Intensity
es: Intensidad

source: Rest Interval
es: Intervalo de Descanso

source: Pull
es: Jalón

source: Olympic Lifting
es: Levantamiento Olímpico

source: Lunge
es: Lunge (Zancada)

source: Dumbbell
es: Mancuerna

# Maximum_Repetition_OneRM
source: Maximum Repetition (1RM)
es: Máxima Repetición (1RM)

source: Bodybuilding
es: Musculación

source: Deadlift
es: Peso Muerto

source: Plank
es: Plancha

source: Plyometrics
es: Pliometría

source: Repetitions (Reps)
es: Repeticiones (Reps)

source: RM (Repetition Maximum)
es: RM (Repetición Máxima)

source: RPE (Rate of Perceived Exertion)
es: RPE (Tasa de Esfuerzo Percibido)

source: Sets
es: Series

source: Submaximal
es: Submáximo

source: Superset
es: Superserie

source: Toning
es: Tonificación

source: Trapezius
es: Trapecio

source: VO2 Max
es: VO2 Máx

source: Training Volume
es: Volumen de Entrenamiento

source: Heart Rate Zone
es: Zona de Frecuencia Cardíaca

# oneRM_One_Repetition_Maximum_definition
source: The maximum weight a person can lift in a single repetition for a specific exercise.
es: El peso máximo que una persona puede levantar en una sola repetición para un ejercicio específico.

# Grip_definition
source: The way to hold a barbell or dumbbells during an exercise. It can be supinated (palms up), pronated (palms down), or neutral (palms facing each other).
es: Forma de sujetar una barra o mancuernas al realizar un ejercicio. Puede ser en supinación (palmas hacia arriba), pronación (palmas hacia abajo) o neutro (palmas enfrentadas).

# Aerobic_definition
source: Exercise that requires oxygen to produce energy, such as running or cycling. It focuses on improving cardiovascular endurance.
es: Ejercicio que requiere oxígeno para producir energía, como correr o andar en bicicleta. Se enfoca en mejorar la resistencia cardiovascular.

# Isolation_definition
source: An exercise that targets a single muscle group, such as a bicep curl.
es: Ejercicio que se enfoca en trabajar un solo grupo muscular, como el curl de bíceps.

# Range_of_Motion_ROM_definition
source: The full range of motion in a joint during an exercise.
es: El rango completo de movimiento en una articulación durante un ejercicio.

# AMRAP_As_Many_Reps_As_Possible_definition
source: A workout where as many repetitions as possible are performed within a set time or until muscle failure.
es: Entrenamiento en el que se realizan tantas repeticiones como sea posible dentro de un tiempo determinado o hasta el fallo muscular.

# Swinging_definition
source: A movement that uses momentum instead of controlled muscular strength, often avoided to prevent injuries.
es: Movimiento que usa impulso en lugar de fuerza muscular controlada, generalmente se debe evitar para prevenir lesiones.

# Biceps_definition
source: A muscle in the upper arm responsible for elbow flexion.
es: Músculo de la parte superior del brazo responsable de la flexión del codo.

# Biomechanics_definition
source: The study of body movement, including how muscles and joints interact during exercises.
es: Estudio del movimiento del cuerpo, que incluye cómo interactúan los músculos y las articulaciones al realizar ejercicios.

# Warm_Up_definition
source: A series of light exercises to prepare the body for training, increasing muscle temperature and circulation.
es: Serie de ejercicios suaves para preparar al cuerpo para el entrenamiento, aumentando la temperatura y la circulación en los músculos.

# Cardiovascular_definition
source: Exercise that improves the efficiency of the cardiovascular system, such as running, swimming, or cycling.
es: Ejercicio que mejora la eficiencia del sistema cardiovascular, como correr, nadar o andar en bicicleta.

# Training_Cycle_definition
source: A defined period for following a specific training routine.
es: Período de tiempo definido para seguir una rutina de entrenamiento específica.

# Core_definition
source: A group of muscles in the midsection of the body, including the abdominals, lower back, and obliques, providing stability.
es: Conjunto de músculos en la zona media del cuerpo, incluyendo abdominales, lumbares y oblicuos, que aportan estabilidad.

# Pull_Ups_definition
source: An exercise involving pulling the body up using the arms and back muscles.
es: Ejercicio de tracción que implica levantar el cuerpo usando los brazos y los músculos de la espalda.

# Drop_Set_definition
source: A technique where weight is reduced after reaching muscle failure to continue the exercise without rest.
es: Técnica donde se reduce el peso después de llegar al fallo muscular para continuar el ejercicio sin descanso.

# e1RM_Estimated_One_Repetition_Maximum_definition
source: An estimation of the maximum weight a person could lift in a single repetition, calculated using formulas based on weight and completed repetitions in a set.
es: Estimación del peso máximo que una persona podría levantar en una sola repetición, calculado mediante fórmulas en base al peso y repeticiones completadas en una serie.

# EMOM_Every_Minute_On_the_Minute_definition
source: A workout where a series of exercises are performed at the start of each minute, resting for the remainder of the minute before starting again.
es: Entrenamiento en el que se realiza una serie de ejercicios al comienzo de cada minuto, descansando el resto del minuto antes de comenzar de nuevo.

# Strength_Training_definition
source: Exercise focusing on developing muscle strength through weightlifting or resistance.
es: Ejercicio que se enfoca en el desarrollo de la fuerza muscular mediante el levantamiento de pesas o resistencia.

# Stretching_definition
source: Exercises to improve flexibility and prevent injuries by stretching the muscles.
es: Ejercicios para mejorar la flexibilidad y prevenir lesiones mediante la elongación de los músculos.

# Compound_Exercise_definition
source: An exercise that works multiple muscle groups and joints, such as bench presses or squats.
es: Ejercicio que trabaja múltiples grupos musculares y articulaciones, como el press de banca o la sentadilla.

# Failure_definition
source: The point at which muscles can no longer perform another repetition with proper form, requiring rest.
es: Punto en el cual los músculos no pueden realizar otra repetición con buena forma, forzando al descanso.

# Muscle_Failure_definition
source: The point at which muscles can no longer perform another repetition with proper form.
es: Punto en el cual los músculos no pueden realizar otra repetición con buena forma.

# Flexibility_definition
source: The ability of a joint to move through its full range of motion.
es: Capacidad de una articulación para moverse a través de su rango de movimiento completo.

# Muscle_Gain_definition
source: The goal of increasing muscle size and volume through strength exercises and proper diet.
es: Objetivo de aumentar el volumen y tamaño de los músculos mediante ejercicios de fuerza y una dieta adecuada.

# Glutes_definition
source: Large muscles in the buttocks responsible for hip extension and rotation.
es: Músculos grandes en la zona de las nalgas, responsables de la extensión y rotación de la cadera.

# Hyperextension_definition
source: Excessive movement of a joint beyond its normal range, which can cause injuries.
es: Movimiento excesivo de una articulación más allá de su rango normal, lo cual puede causar lesiones.

# Hypertrophy_definition
source: Growth in muscle size due to specific training and proper nutrition.
es: Crecimiento del tamaño de los músculos debido a un entrenamiento específico y nutrición adecuada.

# Intensity_definition
source: The level of effort required to perform an exercise or routine, usually measured as a percentage of maximum effort.
es: Nivel de esfuerzo requerido para realizar un ejercicio o una rutina, usualmente medido en porcentaje del esfuerzo máximo.

# Rest_Interval_definition
source: The recovery time between sets or exercises.
es: Tiempo de recuperación entre series o ejercicios.

# Pull_definition
source: A pulling motion, such as in back exercises that require pulling a load toward the body.
es: Movimiento de tracción, como en ejercicios de espalda que requieren tirar de una carga hacia el cuerpo.

# Olympic_Lifting_definition
source: Sports and specific movements that include lifts like the clean and jerk and the snatch.
es: Deportes y movimientos específicos que incluyen levantamientos como el clean and jerk y el snatch.

# Lunge_definition
source: A leg exercise where one foot steps forward and the knee bends, working the glutes and quadriceps.
es: Ejercicio de pierna en el cual un pie da un paso adelante y la rodilla se flexiona, trabajando glúteos y cuadríceps.

# Dumbbell_definition
source: A free weight held in one hand, used in strength exercises.
es: Peso libre que se sostiene en una mano, utilizado en ejercicios de fuerza.

# Maximum_Repetition_OneRM_definition
source: The maximum weight a person can lift in a single repetition for a given exercise.
es: Peso máximo que una persona puede levantar en una sola repetición para un ejercicio determinado.

# Bodybuilding_definition
source: Training focused on developing muscle size and strength.
es: Entrenamiento enfocado en desarrollar tamaño y fuerza muscular.

# Deadlift_definition
source: A compound exercise that involves multiple muscle groups, lifting a barbell from the ground.
es: Ejercicio compuesto que involucra múltiples grupos musculares, levantando una barra desde el suelo.

# Plank_definition
source: An isometric core exercise where the body is held straight in a push-up position.
es: Ejercicio isométrico de core que consiste en mantener el cuerpo recto en posición de flexión.

# Plyometrics_definition
source: Exercises designed to increase power and speed through explosive movements, such as jumps or throws.
es: Ejercicios diseñados para aumentar la potencia y velocidad a través de movimientos explosivos, como saltos o lanzamientos.

# Press_definition
source: A pushing exercise involving movements like bench presses or shoulder presses.
es: Ejercicio de empuje que utiliza movimientos como el press de banca o press de hombros.

# Repetitions_Reps_definition
source: The number of times an exercise is performed in a set.
es: Número de veces que se realiza un ejercicio en una serie.

# RM_Repetition_Maximum_definition
source: The maximum number of repetitions that can be done with a given weight before reaching muscle failure.
es: Número máximo de repeticiones que se pueden hacer con un peso determinado antes de llegar al fallo muscular.

# RPE_Rate_of_Perceived_Exertion_definition
source: A subjective scale measuring perceived exercise intensity, usually from 1 to 10, where 10 is maximum effort.
es: Escala subjetiva que mide la intensidad percibida durante un ejercicio, generalmente de 1 a 10, donde 10 es el máximo esfuerzo posible.

# Sets_definition
source: A set of repetitions performed in an exercise before resting.
es: Conjunto de repeticiones en un ejercicio antes de descansar.

# Submaximal_definition
source: Weight or effort that is below the maximum level, used in training to avoid exhaustion.
es: Peso o esfuerzo que está por debajo del nivel máximo, utilizado en entrenamientos para evitar el agotamiento.

# Superset_definition
source: A technique where two exercises are performed back-to-back without rest, usually for opposing muscle groups.
es: Técnica donde se realizan dos ejercicios seguidos sin descanso, generalmente para grupos musculares opuestos.

# Tempo_definition
source: Controlled speed of each phase of movement in an exercise, often expressed in a sequence of four numbers (e.g., 2-0-2-0) to regulate execution.
es: Velocidad controlada de cada fase del movimiento en un ejercicio, generalmente expresado en una secuencia de cuatro números (ej.: 2-0-2-0) para controlar la ejecución.

# Toning_definition
source: A program of exercises and diet to reduce fat and increase muscle definition without significant volume gains.
es: Programa de ejercicios y dieta para reducir grasa y aumentar la definición muscular sin grandes aumentos de volumen.

# Trapezius_definition
source: A large back muscle that controls scapula and neck movements.
es: Músculo grande de la espalda que controla los movimientos de la escápula y el cuello.

# VO2_Max_definition
source: The body's maximum capacity to transport and use oxygen during intense exercise, an indicator of cardiovascular fitness.
es: Capacidad máxima del cuerpo para transportar y utilizar oxígeno durante el ejercicio intenso, un indicador de la aptitud cardiovascular.

# Training_Volume_definition
source: The total amount of work performed, usually calculated as sets x repetitions x weight.
es: Cantidad total de trabajo realizado, generalmente calculado como series x repeticiones x peso.

# Heart_Rate_Zone_definition
source: The range of heartbeats per minute suitable for a specific training goal (e.g., aerobic, anaerobic zone).
es: Rango de latidos por minuto adecuado para un objetivo específico de entrenamiento (ej.: zona aeróbica, anaeróbica).

# todas
source: All
es: Todas

# grupo
source: Group
es: Grupo

# dificultad
source: Difficulty
es: Dificultad

# descripcion
source: Description
es: Descripción

# instrucciones1
source: Instructions
es: Instrucciones

# logros_globales
source: Global achievements
es: Logros Globales

# logros_obtenidos
source: Achievements obtained
es: Logros Obtenidos

# En_progreso
source: In progress
es: En progreso

# Completadas
source: Completed
es: Completadas

# Sin_comenzar
source: Unstarted
es: Sin comenzar

# sin_descripcion
source: No description
es: No descripción

# valor_inicial
source: Initial value
es: Valor Inicial

# valor_actual
source: Current value
es: Valor Actual

# valor_final
source: final value
es: Valor Final

# progreso
source: Progress
es: Progreso

# eliminar_objetivo
source: Delete Objetive
es: Eliminar Objetivo

# estas_seguro
source: Are you sure you want to remove this target?
es: ¿Estás seguro de que deseas eliminar este objetivo?

# cancelar
source: Cancel
es: Cancelar

# eliminar
source: Delete
es: Eliminar

# Editar_valor
source: Edit Current Value
es: Editar Valor Actual

# valor_valido
source: Please enter a valid value.
es: Por favor, ingresa un valor válido.

# Actualizar
source: Update
es: Actualizar

# Dieta
source: Diet
es: Dieta

# error_usuario
source: Error: User not authenticated
es: Error: Usuario no autenticado

# nuevos_pesos
source: New weights
es: Nuevos pesos

# nuevos_porcentaje
source: New percentage
es: Nuevo porcentaje

# Aumento_rep
source: Increased repetitions
es: Aumento de repeticiones

# Reduccion_tiempo
source: Time reduction
es: Reducción de tiempos

# Titulo_objetivo
source: Title of the objective
es: Título del objetivo

# seleccionar_fecha
source: Select deadline date
es: Seleccionar fecha límite

# fecha_limite
source: Deadline
es: Fecha límite

# guardar_objetivo
source: Save Objective
es: Guardar Objetivo

# crear_objetivo
source: Create new Objetive
es: Crear nuevo Objetivo

# tipo_objetivo
source: Objetive Type
es: Tipo de Objetivo

# acercade
source: Explore how VitalityConnect can help you improve your physical and mental well-being. Discover our mission and vision to inspire you to reach your goals.
es: Explora cómo VitalityConnect puede ayudarte a mejorar tu bienestar físico y mental. Descubre nuestra misión y visión para inspirarte a alcanzar tus objetivos.

# acercade1
source: What is VitalityConnect?
es: ¿Qué es VitalityConnect?

# acercade2
source: VitalityConnect is an application dedicated to helping users track their physical activity and improve their overall health. With personalized functionalities, you can create routines tailored to your needs and join a community that will motivate you to reach your goals.
es: VitalityConnect es una aplicación dedicada a ayudar a los usuarios a realizar un seguimiento de su actividad física y mejorar su salud general. Con funcionalidades personalizadas, puedes crear rutinas adaptadas a tus necesidades y unirte a una comunidad que te motivará a alcanzar tus objetivos.

# acercade3
source: Our Mission
es: Nuestra Misión

# acercade4
source: Our mission is to empower people to lead a healthy lifestyle through physical activity, offering tools and resources that facilitate their progress and well-being.
es: Nuestra misión es empoderar a las personas a llevar un estilo de vida saludable a través de la actividad física, ofreciendo herramientas y recursos que faciliten su progreso y bienestar.

# acercade5
source: Our Vision
es: Nuestra Visión

# acercade6
source: Our vision is to be the leading fitness app, promoting health and wellness worldwide through technology and community.
es: Nuestra visión es ser la aplicación líder en el ámbito del fitness, promoviendo la salud y el bienestar en todo el mundo mediante la tecnología y la comunidad.

# Seleccionado
source: Selected
es: Seleccionado

# idioma
source: Language
es: Idioma

# info_usuario
source: User Information
es: Información de Usuario

# no_info
source: No profile information available
es: No hay información de perfil disponible

# nombre_completo
source: Full Name
es: Nombre completo

# peso
source: Weight
es: Peso

# anios
source: Years old
es: Años

# Estatura
source: Height
es: Estatura

# notificaciones
source: Notifications
es: Notificaciones

# notificaciones1
source: Select the notifications you want to receive on your phone, remember that you have to accept the permissions first
es: Seleccione las notificaciones que desee recibir en su teléfono, recuerde que antes tiene que aceptar los permisos

# notificaciones2
source: Motivational messages
es: Mensajes motivacionales

# notificaciones3
source: Reminders
es: Recordatorios

# notificaciones4
source: Timer
es: Temporizador

# notificaciones5
source: Help
es: Ayuda

# notificaciones6
source: Units applied
es: Unidades aplicadas

# si
source: Yes
es: Si

# ver_info
source: View Information
es: Ver Información

# tema
source: Theme
es: Tema (Proximamente...)

# unidades
source: Units
es: Unidades

# privacidad_datos
source: Data Privacy
es: Privacidad de datos

# acerca_de
source: About...
es: Acerca de...

# privacidad_datos1
source: 1. Introduction
es: 1. Introducción
